base_image: null
bundled_packages_dir: packages
data_dir: data
description: null
environment_variables: {}
examples_filename: examples.yaml
external_package_dirs: []
input_type: Any
live_reload: false
model_class_filename: model.py
model_class_name: Model
model_framework: custom
model_metadata:
  repo_id: meta-llama/Llama-2-13b-hf
model_module_dir: model
model_name: Llama 13B
model_type: custom
python_version: py39
requirements:
- accelerate==0.22.0
- bitsandbytes==0.41.1
- einops==0.6.1
- faker==19.3.1
- peft==0.5.0
- protobuf==3.20.3
- safetensors==0.3.3
- scipy==1.10.1
- sentencepiece==0.1.99
- torch==2.0.1
- transformers==4.32.1
model_cache:
- repo_id: meta-llama/Llama-2-13b-hf
  allow_patterns:
    - "*.json"
    - "*.safetensors"
    - "*.model"
resources:
  cpu: "3"
  memory: 14Gi
  use_gpu: true
  accelerator: A100:1
secrets:
  hf_access_token: null
spec_version: '2.0'
system_packages: []
