bundled_packages_dir: packages
data_dir: data
description: Generate text from a prompt with this seventy billion parameter language model.
environment_variables: {}
examples_filename: examples.yaml
external_package_dirs: []
input_type: Any
live_reload: false
model_class_filename: model.py
model_class_name: Model
model_framework: custom
model_metadata:
  example_model_input: {"prompt": "What's the meaning of life?", "temperature": 0.1, "top_p": 0.75,"num_beams": 4}
  avatar_url: https://cdn.baseten.co/production/static/explore/meta.png
  cover_image_url: https://cdn.baseten.co/production/static/explore/llama.png
  tags:
  - text-generation
model_module_dir: model
model_name: LLaMA 2 70B Chat
model_type: custom
python_version: py38
requirements:
- accelerate==0.22.0
- bitsandbytes==0.41.1
- einops==0.6.1
- faker==19.3.1
- peft==0.5.0
- protobuf==3.20.3
- safetensors==0.3.3
- scipy==1.10.1
- sentencepiece==0.1.99
- torch==2.0.1
- transformers==4.32.1
resources:
  cpu: "3"
  memory: 14Gi
  use_gpu: true
  accelerator: A100:2
secrets:
  hf_access_token: "ENTER HF API KEY HERE"
spec_version: '2.0'
system_packages: []
