apply_library_patches: true
base_image:
  image: baseten/trtllm-server:r23.12_baseten_v0.9.0.dev2024022000
  python_executable_path: /usr/bin/python3
build:
  arguments:
    engine_repository: baseten/llama3-8b-instruct-bs64-8000-8000
    pipeline_parallel_count: 1
    tensor_parallel_count: 1
    tokenizer_repository: baseten/Meta-Llama-3-Instruct-tokenizer
bundled_packages_dir: packages
data_dir: data
description: Generate text from a prompt with this eight billion parameter language
  model.
environment_variables: {}
examples_filename: examples.yaml
external_data: null
external_package_dirs: []
input_type: Any
live_reload: false
model_cache:
  - repo_id: "baseten/llama3-8b-instruct-bs64-8000-8000"
  - repo_id: "baseten/Meta-Llama-3-Instruct-tokenizer"
    allow_patterns:
      - '*.json'
model_class_filename: model.py
model_class_name: Model
model_framework: custom
model_metadata:
  avatar_url: https://cdn.baseten.co/production/static/explore/meta.png
  cover_image_url: https://cdn.baseten.co/production/static/explore/llama.png
  repo_id: meta-llama/Meta-Llama-3-8B-Instruct
  tags:
  - text-generation
  - openai-compatible
model_module_dir: model
model_name: Llama3 8B Instruct
model_type: Model
python_version: py311
requirements:
- tritonclient[all]
- transformers
- jinja2
resources:
  accelerator: A100:1
  use_gpu: true
runtime:
  num_workers: 1
  predict_concurrency: 512
