data_dir: data
input_type: Any
model_class_filename: model.py
model_class_name: Model
model_framework: custom
model_type: custom
description: Classify images with zero-shot-like functionality.
model_metadata:
  avatar_url: https://cdn.baseten.co/production/static/explore/openai.png
  cover_image_url: https://cdn.baseten.co/production/static/explore/clip.png
  tags:
  - image-classification
model_module_dir: model
model_name: "CLIP: Connecting text and images"
python_version: py39
requirements:
  - torchvision==0.8.2
  - git+https://github.com/openai/CLIP.git
resources:
  cpu: 3000m
  memory: 8Gi
  use_gpu: true
system_packages: []
spec_version: 2.0
