apply_library_patches: true
base_image:
  image: nvcr.io/nvidia/tritonserver:24.03-trtllm-python-py3
  python_executable_path: /usr/bin/python3
bundled_packages_dir: packages
data_dir: data
description: Generate text from a prompt with this seven billion parameter language
  model.
environment_variables: {}
examples_filename: examples.yaml
external_data: null
external_package_dirs: []
input_type: Any
live_reload: false
model_class_filename: model.py
model_class_name: Model
model_framework: custom
trt_llm:
  serve:
    engine_repository: baseten/dolphin_i6000_o1024_bs96_tp8-tllm_0.9.0.dev2024032600
    pipeline_parallel_count: 1
    tensor_parallel_count: 8
    tokenizer_repository: cognitivecomputations/dolphin-2.6-mixtral-8x7b
model_metadata:
  engine_repository: baseten/dolphin_i6000_o1024_bs96_tp8-tllm_0.9.0.dev2024032600
  tags:
  - text-generation
  - openai-compatible
model_module_dir: model
model_name: dolfo-new
model_type: Model
python_version: py311
requirements:
- tritonclient[all]
- transformers
- jinja2
resources:
  accelerator: H100:8
  use_gpu: true
runtime:
  num_workers: 1
  predict_concurrency: 1000
secrets: {}
