bundled_packages_dir: packages
data_dir: data
description: null
environment_variables: {}
examples_filename: examples.yaml
input_type: Any
model_class_filename: model.py
model_class_name: Model
model_framework: custom
model_metadata: {}
model_module_dir: model
model_name: null
model_type: custom
python_version: py39
requirements:
- accelerate
- argh
- black
- dacite
- diffusers
- ipdb
- isort
- mypy
- numpy
- pillow
- pydub
- pylint
- scipy
- torch
- torchaudio
- transformers
- types-requests
resources:
  use_gpu: true
secrets: {}
spec_version: '2.0'
system_packages:
- ffmpeg
use_control_plane: true